GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность/гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность</name>
  <registerRecords>InformationRegister.гхб_ОтветственныеЗаПожарнуюБезопасность</registerRecords>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникиКраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_СотрудникиСАдминистративнымиПравамиПБ/гхб_СотрудникиСАдминистративнымиПравамиПБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СотрудникиСАдминистративнымиПравамиПБ</name>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СобытияОбъектовБД/гхб_СобытияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СобытияОбъектовБД</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаКонсервациюПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность</types>
      <types>DocumentRef.гхб_СвойстваПомещений</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПомещение</types>
      <types>DocumentRef.гхб_ЗакреплениеПомещенийЗаСотрудниками</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.гхб_ГруппыПомещений</types>
      <types>DocumentRef.гхб_РаспределениеДоступовВПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаЛокацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.гхб_ТипыСобытийОбъектовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаПожарнуюБезопасность/гхб_ОтветственныеЗаПожарнуюБезопасность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаПожарнуюБезопасность</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственныйЗаПожарнуюБезопасность</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаПожарнуюБезопасность/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
	
	_Администратор = РольДоступна(Метаданные.Роли.ПолныеПрава) 
		ИЛИ (_ФЛ = Справочники.гхб_СлужебныеЗначения.РуководительОтделаОтиПБ.Значение);
		
	Если НЕ _Администратор Тогда
		
		_Массив = РегистрыСведений.гхб_СотрудникиСАдминистративнымиПравамиПБ.ВернутьСотрудниковСАдминистративнымиПравамиПожарнаяБезопасность();
		
		_Администратор = НЕ (_Массив.Найти(_ФЛ) = Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	ЭтотОбъект.ТолькоПросмотр = НЕ _Администратор ИЛИ ДокументБылПроведен(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументБылПроведен(_Ссылка)
	
	Возврат РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(_Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) И _ТекущиеДанные.СуществующийДоступ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиЗакрытьПриИзменении(Элемент)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) И _ТекущиеДанные.Закрыть И НЕ _ТекущиеДанные.СуществующийДоступ Тогда
		
		_ТекущиеДанные.Закрыть = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	
	ЗагрузитьАктуальныхСотрудников(Объект.Помещение)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАктуальныхСотрудников(_Помещение)
	
	Объект.Сотрудники.Очистить();
	
	_МассивСотрудников = ВернутьАктуальныхСотрудниковДляПомещения(_Помещение);
	
	Для Каждого _Сотрудник Из _МассивСотрудников Цикл
		
		НС = Объект.Сотрудники.Добавить();
		НС.Сотрудник = _Сотрудник;
		НС.СуществующийДоступ = Истина;
			
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("СуществующийДоступ УБЫВ, Сотрудник ВОЗР");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьАктуальныхСотрудниковДляПомещения(_Помещение)
	
	Возврат РегистрыСведений.гхб_ОтветственныеЗаПожарнуюБезопасность.ВернутьАктуальныхСотрудниковДляПомещения(_Помещение);
	
КонецФункции

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	_ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НЕ (_ТекущиеДанные = Неопределено) Тогда
		Элементы.СотрудникиСотрудник.ТолькоПросмотр = _ТекущиеДанные.СуществующийДоступ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ТД = Элементы.Сотрудники.ТекущиеДанные;
		ТД.СуществующийДоступ = Ложь;
		ТД.Закрыть = Ложь;

	КонецЕсли;
	
КонецПроцедуры
